package main

// BST (Binary Search Tree) - бинарное дерево поиска. Принцип построения бинарного дерева: 

// 1) Если в узле дерева записано значение X, то в левом поддереве располагаются узлы со значениями, меньшими X. 

// 2) Если в узле дерева записано значение X, то в правом поддереве располагаются узлы со значениями, большими или равными X.

// 3) левое и правое поддерево отвечают тем же условиям. То есть любое поддерево в дереве поиска будет являться деревом поиска.


// Задание: необходимо по заданным элементам построить бинарное дерево поиска. 